{
  "categories": [
    {
      "title": "Distribution & Statistical Plots",
      "description": "Visualizations for exploring data distributions, variability, and statistical relationships across experimental conditions.",
      "items": [
        {
          "file": "boxplot.svg",
          "name": "Box Plot Analysis",
          "description": "Statistical distribution visualization showing median, quartiles, and outliers across multiple experimental groups. Ideal for comparing gene expression levels between conditions."
        },
        {
          "file": "violin_plot.svg",
          "name": "Violin Plot",
          "description": "Combines box plot statistics with kernel density estimation to show the full distribution shape. Perfect for visualizing expression patterns in single-cell RNA-seq data."
        },
        {
          "file": "dotplot.svg",
          "name": "Dot Plot Matrix",
          "description": "Multi-dimensional visualization displaying gene expression levels across different cell types or conditions using size and color encoding for dual-metric representation."
        },
        {
          "file": "single_dotplot.svg",
          "name": "Single Dot Plot",
          "description": "Focused dot plot visualization for comparing expression patterns of selected genes across specific cell populations or experimental timepoints."
        }
      ]
    },
    {
      "title": "Temporal & Sequential Analysis",
      "description": "Time-series and trajectory visualizations for understanding dynamic biological processes and developmental patterns.",
      "items": [
        {
          "file": "lineplot.svg",
          "name": "Time Series Line Plot",
          "description": "Temporal gene expression dynamics across multiple timepoints. Captures expression trajectories during differentiation or treatment response studies."
        },
        {
          "file": "response_plot.svg",
          "name": "Response Curve Analysis",
          "description": "Dose-response or time-response curves showing biological system reactions to varying stimuli concentrations or temporal exposures."
        }
      ]
    },
    {
      "title": "High-Dimensional Data",
      "description": "Complex visualizations for multi-dimensional genomic data including dimensional reduction and correlation analyses.",
      "items": [
        {
          "file": "scatterplot.svg",
          "name": "Scatter Plot Analysis",
          "description": "High-density scatter plot for exploring relationships between continuous variables. Features regression lines and confidence intervals for correlation analysis."
        },
        {
          "file": "umap_plot.svg",
          "name": "UMAP Dimensionality Reduction",
          "description": "Uniform Manifold Approximation and Projection visualization revealing cell clusters and trajectories in single-cell transcriptomic datasets."
        },
        {
          "file": "maplot.svg",
          "name": "MA Plot",
          "description": "Log-ratio (M) versus mean expression (A) plot for differential expression analysis. Highlights significantly regulated genes with fold-change thresholds."
        }
      ]
    },
    {
      "title": "Circular & Network Visualizations",
      "description": "Specialized plots for genomic interactions and circular chromosome representations.",
      "items": [
        {
          "file": "circos_plot.svg",
          "name": "Circos Plot",
          "description": "Circular genomic visualization displaying chromosomal rearrangements, copy number variations, and inter-chromosomal interactions from Hi-C or ChIP-seq experiments."
        }
      ]
    }
  ]
}